tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "robotsandpencils/made"
tap "supabase/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Interactive command-line tool for using emoji in commit messages
brew "gitmoji"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Simplistic interactive filtering tool
brew "peco"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Install and switch between multiple versions of Xcode
brew "robotsandpencils/made/xcodes"
# Supabase CLI
brew "supabase/tap/supabase"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Chromium based browser
cask "arc"
# Tools for building Android applications
cask "android-studio"
# SQL client and database management tool
cask "cmd-eikana"
# Universal database tool and SQL client
cask "docker"
# Client for the Dropbox cloud storage service
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Shows hidden files and folders and switches their visibility in Finder
cask "google-chrome"
# Japanese input software
cask "google-japanese-ime"
# Screenshot and screen recording tool
cask "iterm2"
# JetBrains tools manager
cask "visual-studio-code"
# Rust-based terminal
cask "zoom"
mas "LINE", id: 539883307
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "ajmnz.prisma-import"
vscode "Arjun.swagger-viewer"
vscode "astro-build.astro-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "byCedric.vscode-expo"
vscode "christian-kohler.path-intellisense"
vscode "codecov.codecov"
vscode "CodeQue.codeque"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kamikillerto.vscode-colorize"
vscode "KyleDavidE.vscode-project-links"
vscode "mattpocock.ts-error-translator"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "seatonjiang.gitmoji-vscode"
vscode "Shan.code-settings-sync"
vscode "streetsidesoftware.code-spell-checker"
vscode "sysoev.language-stylus"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "vscode-icons-team.vscode-icons"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "xyc.vscode-mdx-preview"
vscode "xyz.local-history"
vscode "yoavbls.pretty-ts-errors"
vscode "yusukehirao.vscode-markuplint"
vscode "yzhang.markdown-all-in-one"
